start_phrase = '''Добрый день!
Меня зовут "ТехноРоббо", я - чатбот ТЕХНОШКОЛЫ 🤖!
Приветствую вас на мероприятии "Январский квест 🚸", который мы разработали для наших любимых учеников центра ТЕХНОШКОЛА!
У Вашего ребенка впереди 8 дней каникул, а это значит, 8 увлекательных заданий на каждый день!
Задания будут открываться в нашем с вами чате, и ответы вы сможете отправлять мне прямо сюда 😍!
Позвольте, я буду напоминать вам – направлять уведомления, если вдруг, вы про меня забыли😓. Первое необычное задание вам придет 1 января 2023 года 📆, вы можете пройти его в удобное вам время в течение суток ☺️. Главное, до 00:00 2 января.
Ребятам, кто пройдет весь квест, я подарю сертификат о прохождении квеста; кто ответит все вопросы, получит билет на любой мастер-класс от центра ТЕХНОШКОЛА; а кто ответит правильно и в назначенный срок на все задания, получат билеты 👩‍👦 в мультимедийную галерею "ЛЕС" на ВДНХ 🎉 http://les.gallery (http://les.gallery/) . Ну что, начнем?!) 
*Короткие правила участия - https://drive.google.com/drive/folders/1l2qK0iHQaIwVX9s100bBCYXzmvzHJKkS?usp=sharing
ВНИМАНИЕ! Если у вас есть вопросы по работе чатбота или по заданиями, нажмите на кнопку "Помощь с ботом"
Все вопросы скрыты в строке: кнопка внизу справа с 4 🔡 точками.
'''

day_1_phrase = """1 января, первый день каникул! Впереди ещё 8 дней отдыха, а значит можно заняться чем-то интересным. Например - путешествием! И лучше всего поехать туда, где сейчас оооочень тепло - на Мальдивы!
Вам потребуется компьютер с доступом в интернет. Зайдите в Гугл Карты. В строку “Поиск на Google Картах” вставьте координаты - 
“2.9356, 72.9613”.
На появившуюся красную точку перетащите жёлтого человечка из правого нижнего угла “Режим просмотра улиц”.
И правда - очень красиво! Оглянитесь вокруг!
Впишите ответ на вопрос: Какая конструкция находится к Вам ближе всего?
"""

day_2_phrase = """2 января, второй день каникул. День, когда заготовленной еды на праздник почти не осталось, но впереди всё ещё целая неделя отдыха и провести их нужно интересно!
Попробуем отправиться ещё дальше, чем на Мальдивы. Я перехватил шифр, в котором скрыта наша с Вами следующая тема!
Разгадайте шифр и ответьте на скрытый вопрос.
"""

day_3_phrase = """3 января, третий день каникул! Мы с вами отправляемся ещё дальше, в бескрайний космос. Какие же тут красивые виды и столько всего интересного!
Взглянем на самый крупный объект Солнечной системы - Солнце. Столько интересных фактов можно найти про Солнце и космос в интернете, попробуйте! Расстояние между Землей и Солнцем постоянно меняется, но всё же, какое оно примерно?
Укажите среднее расстояния от земли до солнца в формате целого трёхзначного числа (Например 123, что будет означать 123 млн.км.). 
"""

day_4_phrase = """4 января, четвёртый день каникул! Все мы любим смотреть мультфильмы, особенно в каникулы, когда у нас полно на это времени. Но чтобы не пролежать на диване все каникулы можно попробовать разобраться как делаются мультфильмы и попробовать даже сделать свой!
Для того, чтобы разобраться с производством мультфильмов давайте зайдём на ютюб, найдём канал “GalileoRU” и посмотрим видео с названием “Галилео. Смешарики”. Это прекрасный репортаж, который расскажет о важных этапах создания любого мультфильма!
А для создания собственного мультфильма попробуйте использовать бесплатное приложение “Stop Motion Studio”, которое можно установить на любой телефон, используйте любые игрушки, декорации и попробуйте создать свой мультфильм в каникулы!
После просмотра репортажа Галилео дайте ответ на вопрос: какое средство передвижения использует главный режиссёр для перемещения по студии?
"""

day_5_phrase_1 = """5 января, пятый день каникул! Пора снова прогуляться! Если выйти на улицу и посмотреть на дома сверху, с высоты птичьего полёта, то на что они будут похожи?
Очень многие дома имеют знакомые нам формы, а некоторые даже напоминают конкретные символы!
В этот раз зайдём на Яндекс Карты для разнообразия. Используйте режим “Спутника” нажав на квадратики в правом верхнем углу, так становится интереснее."""

day_5_phrase_2 = """Вам будет дан список адресов, на которых дома что-то ну очень напоминают…
Составьте дома в правильной последовательности и запишите в ответ.
Москва, ул. Довженко, 6;
Минск, ул. Сурганова, 88;
Санкт-Петербург, Набережная канала Грибоедова, 30-32;
Екатеринбург, ул. Заводская, 44;
Нижний Новгород, ул. Кремль, 1;
Иркутск, ул. Байкальская, 77;
Барнаул, ул. Гоголя, 52;
Нур-Султан (Астана), ул. Акан Сери, 22.

"""

day_6_phrase = """6 января, шестой день каникул! Осталось ещё целых три дня на отдых! 
И впереди нас ждёт ещё один праздник, но пока мы не начали к нему готовиться давайте слушать музыку!
Вам будет дан список конкретных композиций, прослушайте их и найдите в них ответы. В строке ответа перечислите полученные слова через запятую в любом порядке.
Какого цвета единственный пернатый в песне Ольги Рождественской - Песня Красной Шапочки (из к/ф Про Красную Шапочку)?
Что предлагает делать заяц волку в припеве в песне “Расскажи, Снегурочка, где была?” из 8-го выпуска “Ну, погоди”?
Что такое “Акуна Матата”? Песня Тимона и Пумбы из мультфильма “Король Лев” 1994 года.
"""

day_7_phrase = """7 января, седьмой день каникул и Рождество, второй праздник за каникулы! Но знаете ли вы о нём? Давайте попробуем немного познакомиться с этим праздником через искусство!
Найдите в интернете знаменитую картину “Рождество Христово” (Поклонение пастухов). Шебуев Василий Козьмич. 1847 год.
"""

day_8_phrase = """8 января, последний, а поэтому самый ценный день каникул! Вы столько всего интересного сделали за эти каникулы и узнали много нового! Последний день каникул должен быть один из самых ярких, чтобы с радостью вернуться к делам. Давайте сделаем что-то, чтобы оставить память об этих каникулах!
Для этого вам понадобятся листы А4(можно цветные), ножницы и линейка.
Найдите на просторах интернета сайт “fanibani.ru”, сайт встретит вас жёлто-чёрным логотипом и огромным количеством статей с идеями. В поисковой строке справа напишите “Оригами”, кликните на поиск. Нажмите на картинку с узнаваемыми желтыми птицами из “Angry Birds” и названием “Оригами из бумаги: ТОП-70 схем поделок (легкие и пошаговые)“.
Просмотрите и выберите любую поделку, которая вам приглянулась!
Учащиеся, которые принесут полностью заполненный бланк и поделку оригами на первое занятие января получают приз от Техношколы. Поделку сразу после занятия можно будет забрать домой и оставить на память!
В качестве ответа надо прислать фото 🤖 (сжатое)
"""

day_1 = "01.01.23"
day_2 = "02.01.23"
day_3 = "03.01.23"
day_4 = "04.01.23"
day_5 = "05.01.23"
day_6 = "06.01.23"
day_7 = "07.01.23"
day_8 = "08.01.23"

FIO, TELEPHONE_NUMBER, ANSWER = 0, 1, 2
TIME_FOR_REGISTRATION = 36000
TIME_FOR_ANSWER = 10000


keyboard_menu = [
                ['Помощь с ботом'],
                ['Вопрос от 1 января 📍', 'Вопрос от 2 января 👨‍🚀'],
                ['Вопрос от 3 января 🔢', 'Вопрос от 4 января ❄️'],
                ['Вопрос от 5 января 🎭', 'Вопрос от 6 января 🤹‍♀️'],
                ['Вопрос от 7 января 🧚', 'Вопрос от 8 января 📥'],
            ]
